## https://www.kaggle.com/c/instacart-market-basket-analysis

- aisles.csv       

- order_products__prior.csv  

- orders.csv    

- sample_submission.csv

- departments.csv

- order_products__train.csv

- products.csv

### instructions:

> order_products_prior give the order information of all users in the history. order_products_train give the current order information of some users. You need to predict the current order of rest of users.

In [1]:
import numpy as np
import pandas as pd
import pickle

from tqdm import *

In [2]:
DATA_ROOT = "/media/felipe/ssd_vol/instacart/"
PICKLE_ROOT = DATA_ROOT+"pickles/"

In [3]:
aisles_df = pd.read_csv(DATA_ROOT+"aisles.csv")

In [4]:
last_items_ordered_df = pd.read_csv(DATA_ROOT+"order_products__train.csv")

In [5]:
orders_df = pd.read_csv(DATA_ROOT+"/orders.csv")

In [6]:
departments_df = pd.read_csv(DATA_ROOT+"/departments.csv")

In [7]:
products_df = pd.read_csv(DATA_ROOT+"/products.csv")

In [8]:
prior_items_ordered_df = pd.read_csv(DATA_ROOT+"order_products__prior.csv")

## aisles

In [9]:
aisles_df.sample(5)

     aisle_id                         aisle
131       132                        beauty
55         56                 diapers wipes
67         68  bulk grains rice dried goods
16         17            baking ingredients
38         39               seafood counter

## departments

In [10]:
departments_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

## products

In [11]:
products_df.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [12]:
len(products_df)

49688

In [13]:
max(products_df["product_id"])

49688

## orders

In [14]:
orders_df.sample(10)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2235960,2510536,134680,prior,3,6,12,30.0
3251580,1926425,195993,prior,76,1,12,2.0
3009140,2911697,181583,prior,17,1,19,30.0
2366181,900179,142427,prior,4,0,11,7.0
1332014,2294556,80025,prior,4,0,10,12.0
3260503,516933,196498,prior,18,4,22,10.0
2173230,3329797,130782,prior,16,6,12,9.0
253689,409417,15371,prior,1,0,16,NaN
712667,1573911,42943,prior,9,1,20,16.0
1844877,2667881,110741,prior,63,3,8,1.0

In [15]:
orders_df.groupby('eval_set').count()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
eval_set,,,,,,
prior,3214874,3214874,3214874,3214874,3214874,3008665
test,75000,75000,75000,75000,75000,75000
train,131209,131209,131209,131209,131209,131209

In [16]:
len(orders_df[orders_df['eval_set']=='test']['order_id'].unique())

75000

In [17]:
last_items_ordered_df.sample(10)

         order_id  product_id  add_to_cart_order  reordered
799093    1968588       34126                 12          0
923038    2277825       21137                 16          1
201765     494597        5876                  3          1
640579    1576790       45290                  4          1
1362998   3368485       29487                  8          0
290081     706493       23594                 14          1
31022       75159       49683                  6          0
284412     691899       36070                  3          1
814945    2010246       45840                  8          0
137931     336670       32465                  5          1

### users_df, derived

In [18]:
users_df = orders_df[["user_id"]]

In [19]:
users_df = users_df.drop_duplicates().reset_index().drop('index',axis=1)

In [20]:
users_df.head()

   user_id
0        1
1        2
2        3
3        4
4        5

## denormalizing

In [21]:
last_items_ordered_df = pd.merge(last_items_ordered_df,orders_df,on='order_id',how='left')

In [22]:
prior_items_ordered_df = pd.merge(prior_items_ordered_df,orders_df,on='order_id',how='left')

In [23]:
unique_user_ids = set(orders_df.groupby('user_id').groups.keys())

In [24]:
len(unique_user_ids)

206209

In [25]:
unique_product_ids = set(products_df['product_id'].values)

In [26]:
len(unique_product_ids)

49688

## what is the static reorder_factor for each user?

I.e. what percentage of products is reordered?

> since we need data from both the prior as from the last dataframes, we need to calculate sum and counts separately, because mean of means would not be correctly weighted.

In [27]:
users_df['reorder_cl'] = last_items_ordered_df.groupby('user_id')['reordered'].count()
users_df['reorder_sl'] = last_items_ordered_df.groupby('user_id')['reordered'].sum()

users_df['reorder_cp'] = prior_items_ordered_df.groupby('user_id')['reordered'].count()
users_df['reorder_sp'] = prior_items_ordered_df.groupby('user_id')['reordered'].sum()


users_df['user_reorder_factor'] = (users_df['reorder_sl'] + users_df['reorder_sp']) / (users_df['reorder_cl'] + users_df['reorder_cp'])

users_df.drop(['reorder_cl','reorder_sl','reorder_cp','reorder_sp'],axis=1,inplace=True)

In [28]:
users_df.head()

   user_id  user_reorder_factor
0        1                  NaN
1        2             0.728571
2        3             0.464602
3        4                  NaN
4        5                  NaN

In [29]:
to_save = users_df[["user_id","user_reorder_factor"]]
to_save.set_index("user_id",inplace=True)
pickle.dump(to_save.to_dict()['user_reorder_factor'],open(PICKLE_ROOT+"static_user_reorder_factors.p","wb"))

## now do the same for each product

In [30]:
# last orders
products_df['reorder_cl'] = last_items_ordered_df.groupby('product_id')['reordered'].count()
products_df['reorder_sl'] = last_items_ordered_df.groupby('product_id')['reordered'].sum()

products_df['product_reorder_factor'] = (products_df['reorder_sl']) / (products_df['reorder_cl'])

products_df.drop(['reorder_cl','reorder_sl'],axis=1,inplace=True)

In [31]:
products_df.head(10)

,product_id,product_name,aisle_id,department_id,product_reorder_factor
0,1,Chocolate Sandwich Cookies,61,19,NaN
1,2,All-Seasons Salt,104,13,0.644737
2,3,Robust Golden Unsweetened Oolong Tea,94,7,0.250000
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,1.000000
4,5,Green Chile Anytime Sauce,5,13,0.636364
5,6,Dry Nose Oil,11,11,1.000000
6,7,Pure Coconut Water With Orange,98,7,NaN
7,8,Cut Russet Potatoes Steam N' Mash,116,1,1.000000
8,9,Light Strawberry Blueberry Yogurt,120,16,0.538462
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,0.400000

In [32]:
product_factors = products_df[["product_id","product_reorder_factor"]]
product_factors.set_index("product_id",inplace=True)
pickle.dump(product_factors.to_dict()['product_reorder_factor'],open(PICKLE_ROOT+"static_product_reorder_factors.p","wb"))

In [33]:
product_factors.head()

            product_reorder_factor
product_id
1                              NaN
2                         0.644737
3                         0.250000
4                         1.000000
5                         0.636364

### what are all products ever ordered by each user in the test set?

>  ONLY THE LAST ORDER MADE BY THE USER (except the order in the test set, obviously)

In [34]:
users_in_test_set = orders_df[orders_df['eval_set']=='test'][["user_id","order_id","order_number"]]

In [35]:
users_in_test_set.head(10)

     user_id  order_id  order_number
38         3   2774568            13
44         4    329954             6
53         6   1528013             4
96        11   1376945             8
102       12   1356845             6
152       15   2161313            23
159       16   1416320             7
217       19   1735923            10
222       20   1980631             5
272       22    139655            16

In [36]:
last_order_number_by_users_in_test_set = users_in_test_set.groupby("user_id")["order_number"].max().to_frame().reset_index()
last_order_number_by_users_in_test_set.head(10)

   user_id  order_number
0        3            13
1        4             6
2        6             4
3       11             8
4       12             6
5       15            23
6       16             7
7       19            10
8       20             5
9       22            16

In [37]:
second_last_order_number_for_users_in_test_set = last_order_number_by_users_in_test_set
second_last_order_number_for_users_in_test_set["order_number"] = second_last_order_number_for_users_in_test_set["order_number"]-1
second_last_order_number_for_users_in_test_set.head(10)

   user_id  order_number
0        3            12
1        4             5
2        6             3
3       11             7
4       12             5
5       15            22
6       16             6
7       19             9
8       20             4
9       22            15

In [66]:
second_to_last_orders_for_users_in_test_set = pd.merge(second_last_order_number_for_users_in_test_set,orders_df,on=('user_id','order_number'),how='left')
second_to_last_orders_for_users_in_test_set.head(10)
second_to_last_orders_for_users_in_test_set.drop(["order_number","eval_set","order_dow","order_hour_of_day","days_since_prior_order"],axis=1,inplace=True)

In [67]:
second_to_last_orders_for_users_in_test_set.head(10)

   user_id  order_id
0        3   1402502
1        4   2557754
2        6    998866
3       11   1468214
4       12    221248
5       15    487368
6       16   2000615
7       19     86918
8       20   2741696
9       22   2647850

In [68]:
products_prior = prior_items_ordered_df[["product_id","order_id","reordered"]]
products_last = last_items_ordered_df[["product_id","order_id","reordered"]]
all_products_and_orders = pd.concat([products_prior,products_last])

In [69]:
last_products_for_users_in_test_set = pd.merge(second_to_last_orders_for_users_in_test_set,all_products_and_orders,on='order_id',how='left')

In [70]:
last_products_for_users_in_test_set.sample(10)

        user_id  order_id  product_id  reordered
664342   175039    491243       41793          1
395279   104044   2897718        9739          1
686435   181018   3013652       44142          0
57570     15472   2053740       33401          1
370088    97377    617719       40233          1
690486   182045   2300682       13660          1
49012     13303   2767674       25691          1
685171   180629     80160       35108          0
406306   106910   3250768       17819          1
348922    91607   2489794       24852          0

## here is the difference: only consider stuff where reordered=1

In [71]:
last_products_for_users_in_test_set = last_products_for_users_in_test_set.query('reordered == 1')
last_products_for_users_in_test_set.drop(['order_id',"reordered"],axis=1,inplace=True)

In [73]:
last_products_for_users_in_test_set.head(10)

    user_id  product_id
0         3       39190
1         3       18599
2         3       23650
3         3       21903
4         3       47766
5         3       24810
14       11       33572
15       11       27959
18       11        8309
27       12       13176

In [74]:
orders_in_test_set = orders_df[orders_df["eval_set"]=="test"].drop(["eval_set","order_number","order_dow","order_hour_of_day","days_since_prior_order"],axis=1)

In [75]:
orders_in_test_set.head(10)

     order_id  user_id
38    2774568        3
44     329954        4
53    1528013        6
96    1376945       11
102   1356845       12
152   2161313       15
159   1416320       16
217   1735923       19
222   1980631       20
272    139655       22

In [91]:
submission.head(10)

   order_id                                         product_id
0        17                                        13107 21463
1        34           2596 47792 39475 16083 47766 44663 13176
2       137      25890 44422 5134 23794 24852 2326 29594 41787
3       182                  5479 33000 39275 32109 47672 9337
4       257  27104 29837 37646 49235 24852 39475 35734 3023...
5       313          12779 13198 21903 45007 28535 30391 46906
6       353                                        40688 35561
7       386  15872 21479 28985 38281 45066 25513 39180 4075...
8       414                                  27705 20564 31215
9       418                 13702 40268 5262 45364 47766 30489

In [88]:
submission = pd.merge(
pd.merge(   
    pd.merge(
        orders_in_test_set,
        last_products_for_users_in_test_set,
        on='user_id',
        how='left'
    ).drop("user_id",axis=1),
    product_factors.reset_index(),
    on='product_id',
    how='left'
).fillna(
    -1 ## to keep the NaN
).groupby(
    "order_id"
)["product_id"].apply(
     lambda prod_ids: ' '.join([str(int(i)) for i in set(prod_ids) ])
).to_frame().reset_index().replace(
    to_replace='-1', 
    value='None' ## adjust the NaNs
).sort_values("order_id"),
orders_in_test_set,
    on="order_id",
    how="right").sort_values("order_id")[["order_id","product_id"]].fillna("None")

In [89]:
submission.rename(columns={"product_id":"products"}).to_csv("just-repeat-unsorted.csv",index=False)